src/Documents/УстановкаЦенПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УстановкаЦенПоставщика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УстановкаЦенПоставщика/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Параметры:
//  товары - ТабличнаяЧасть - Таблица (приемник) документа в которую будет выполнена запись данных из прайс-листа
//  прайсЛист - ТабличныйДокумент - Прайс-лист (источник) - табличный документ
//      данные из которого будут помещены в Таблица приемника
// Возвращаемое значение:
//  - Число - Количество записанных строк данных из прайс-листа
Функция ЗаполнитьТаблицуТоваров(Знач товары, Знач прайсЛист) Экспорт
    прайсДист = Неопределено;
    Попытка
        прайсДист = Обработки.ЗагрузкаПрайсЛиста.ПолучитьТаблицуЗначенийИзТабличногоДокумента(прайсЛист);
    Исключение
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = СтрШаблон(
                "Ошибка чтения данных из прайс-листа.
                |Описание ошибки: %1", ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
        Сообщение.Сообщить();

        Возврат 0;
    КонецПопытки;

    запрос = Новый Запрос;
    запрос.Текст =
        "ВЫБРАТЬ
        |    ТаблицаПрайсЛиста.АртикулНоменклатуры КАК Артикул,
        |    ТаблицаПрайсЛиста.Цена КАК Цена
        |ПОМЕСТИТЬ ВТ_ТаблицаПрайсЛиста
        |ИЗ
        |    &ТаблицаПрайсЛиста КАК ТаблицаПрайсЛиста
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    Ном.Ссылка КАК Номенклатура,
        |    ВТ_ТаблицаПрайсЛиста.Цена КАК Цена
        |ИЗ
        |    ВТ_ТаблицаПрайсЛиста КАК ВТ_ТаблицаПрайсЛиста
        |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
        |        ПО ВТ_ТаблицаПрайсЛиста.Артикул = Ном.Артикул
        |";

    запрос.УстановитьПараметр("ТаблицаПрайсЛиста", прайсДист);
    результатВыполненияЗапроса = запрос.Выполнить();
    выборка = результатВыполненияЗапроса.Выбрать();

    количествоЗаписанныхСтрок = 0;
    Пока выборка.Следующий() Цикл
        новСтрокаТовары = товары.Добавить();
        новСтрокаТовары.Номенклатура = выборка.Номенклатура;
        новСтрокаТовары.Цена = выборка.Цена;

        количествоЗаписанныхСтрок = количествоЗаписанныхСтрок + 1;
    КонецЦикла;

    Возврат количествоЗаписанныхСтрок;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
